brew "asdf"
brew "gh"
brew "git"
brew "hub"
brew "micromamba"
brew "pipenv"
brew "shellcheck"
brew "tree"

# needed for building Ruby through asdf
# https://github.com/rbenv/ruby-build/wiki#macos
brew "openssl@3"
brew "readline"
brew "libyaml"
brew "gmp"
brew "autoconf"

cask "1password"
cask "bartender"
cask "bluesnooze"
cask "dash"
cask "docker"
cask "dropbox"
cask "firefox"
# don't fail if Chrome is already installed
cask "google-chrome" unless File.exist?('/Applications/Google Chrome.app')
cask "google-drive"
cask "iterm2"
cask "signal"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "zoom"
