brew "asdf"
brew "gh"
brew "git"
brew "homebrew/brew-vulns/brew-vulns"
brew "pipx"
brew "shellcheck"
brew "tree"
brew "uv"
brew "wget"

# needed for building Ruby through asdf
# https://github.com/rbenv/ruby-build/wiki#macos
brew "openssl@3"
brew "readline"
brew "libyaml"
brew "gmp"
brew "autoconf"

cask "1password"
cask "bartender"
#cask "bluesnooze"
cask "dash"
cask "docker-desktop"
#cask "dropbox"
#cask "firefox"
cask "gcloud-cli"
# https://learn.microsoft.com/en-us/azure/devops/repos/git/set-up-credential-managers?view=azure-devops
cask "git-credential-manager"
# don't fail if Chrome is already installed
cask "google-chrome" unless File.exist?('/Applications/Google Chrome.app')
cask "google-drive"
cask "harvest"
# for exporting Jupyter notebooks as PDFs
# https://nbconvert.readthedocs.io/en/latest/install.html#installing-tex
cask "mactex-no-gui"
# conda+mamba
cask "miniforge"
cask "signal"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "zoom"
